cpp/icoFoamParalution/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoamParalution;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.001;

deltaT          0.000025;

writeControl    timeStep;

writeInterval   4;

purgeWrite      0;

writeFormat   ascii;//  binary; //[binary|ascii]

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

adjustTimeStep yes;

maxCo 0.5;


// ************************************************************************* //
