cpp/icoFoamParalution/system/fvSolutionAMG_CPU_PBiCGGPU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-05;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration false;
        nCellsInCoarsestLevel 256;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
    solver                  paralution_PBiCG;
    preconditioner          paralution_MultiColoredILU;
    ILUp                    0;
    ILUq                    1;
    MatrixFormat            ELL;
    PrecondFormat           ELL;
    tolerance               1e-05;
    relTol                  0;
    maxIter                 100000;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
