cpp/icoFoamParalution/system/fvSolutionParalution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
    solver                paralution_PCG;
    preconditioner        paralution_MultiColoredILU;
    ILUp                  0;
    ILUq                  1;
    MatrixFormat          ELL;
    PrecondFormat         ELL;

    tolerance             1e-6;
    maxIter               100000;
    }

    U
    {
    //    solver          smoothSolver;
    //    smoother        symGaussSeidel;
        solver          paralution_PBiCG;
        preconditioner        paralution_MultiColoredILU;
        ILUp                  0;
        ILUq                  1;
        MatrixFormat          ELL;
        PrecondFormat         ELL;
        tolerance       1e-05;
        relTol          0;
        maxIter         100000;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
