cpp/icoFoamParalution/system/fvSolutionParalutionMG_SP
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  paralution_AMG_SP;
        MatrixFormat            ELL;

        preconditioner          paralution_MultiColoredILU;
        ILUp                    0;
        ILUq                    1;
        PrecondFormat           ELL;

        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration false;
        nCellsInCoarsestLevel 256;
        agglomerator    faceAreaPair;
        mergeLevels     1;


//        CoarseGridSolver        CG
//        preconditioner          none;
//        PrecondFormat           CSR;

//        InterpolationType       SmoothedAggregation;
//        AggrRelax               2.0/3.0;
//        nCellsInCoarsestLevel   256;
//        couplingStrength        0.01;
//        Relaxation              1.3;
//        scaleCorrection         true;

        tolerance               1e-04;

        maxIter                 100000;

    }

    U
    {
    //    solver          smoothSolver;
    //    smoother        symGaussSeidel;
        solver          paralution_PBiCG_SP;
        preconditioner        paralution_MultiColoredILU;
        ILUp                  0;
        ILUq                  1;
        MatrixFormat          ELL;
        PrecondFormat         ELL;
        tolerance       1e-05;
        relTol          0;
        maxIter         100000;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
